# _*_ coding : utf-8 _*_
# @Time : 2022/11/13 23:06
# @Author : 小仙女儿张灵
# @File : demo5
# @Project : 子木
# 多分支结构，多选一
'''从键盘录入一个整数 成绩
90-100   A
80-89    B
70-79    C
60-69    D
0-59     E
小于0或大于100为非法数据（不是正常人成绩的有效范围）
'''
score=int(input('请输入一个整数'))
# 判断
if score>=90 and score<=100:   # 90<=score<=100   只有Python中可以这么写，以下相同
    print('恭喜您取得A级，希望您再接再厉创造辉煌')
elif score>=80 and score<=89:
    print('恭喜你取得B级，下次做题细心点，分数有点低')
elif score>=70 and score<=79:
    print('你都C级了，这段时间学习情况不用我说了吧，你自己心里有数')
elif score>=60 and score<=69:
    print('哎呦喂，D级啊，你可真行，上课把老师的话当耳旁风吗？考这成绩你好意思拿出来，我都嫌丢人')
elif score>=0 and score<=59:
    print('呵，E级呢，咱就是说呢，下次出门别人问你老师是谁别说是我行吗,咱俩没关系哈')
else:
    print('恭喜您，超出正常成绩范围，获得称号“我就是人才”，你这个成绩哈，多少有点非正常人的意思了，自己好好想想吧')